## Handling Missing Data with Pandas

In [1]:
import numpy as np
import pandas as pd

## Steps

### **1. Step:** 
* Find the missing data -ex: you can fill it with average value of the missing one-

### **2. Step:** 
* Invalid values -ex: full of int value in a column could have a string, find it-

### Pandas utility functions

Similarly to numpy, pandas also has a few utility functions to identify and detect null values:

In [2]:
pd.isnull(np.nan) # nan is not a number

True

In [3]:
pd.isnull(None) # same thing

True

In [4]:
pd.isna(np.nan) #Â isna = isnull, again same thing

True

The opposite one is:

In [5]:
pd.notnull(None)

False

In [6]:
pd.notnull(np.nan)

False

These functions also work with the Series and DataFrames:

In [7]:
series = pd.Series(
    [1, np.nan, 7]
)

In [8]:
series

0    1.0
1    NaN
2    7.0
dtype: float64

In [9]:
pd.isnull(series)

0    False
1     True
2    False
dtype: bool

In [10]:
df = pd.DataFrame({
    'Column A': [1, np.nan, 7],
    'Column B': [np.nan, 2, 3],
    'Column C': [np.nan, 2, np.nan]
})

In [11]:
df

   Column A  Column B  Column C
0       1.0       NaN       NaN
1       NaN       2.0       2.0
2       7.0       3.0       NaN

In [12]:
pd.isnull(df)

   Column A  Column B  Column C
0     False      True      True
1      True     False     False
2     False     False      True

In [13]:
pd.notnull(df)

   Column A  Column B  Column C
0      True     False     False
1     False      True      True
2      True      True     False

### Pandas Operations with Missing Values

* You can **drop** the missing rows or **filling** in with proper values

In [21]:
s = pd.Series(
    [1, 2, 3, np.nan, 4, 5]
)

In [22]:
pd.notnull(s)

0     True
1     True
2     True
3    False
4     True
5     True
dtype: bool

In [25]:
# Returns total notnulls / isnulls True = 1 False = 0 
# In python booleans stored as 1 and 0s
pd.notnull(s).sum()

5

### Dropping null values

* Basically drops row that contains with null value

In [28]:
# IT IS NOT ACTUALLY MODIFIES THE SERIES!!!
s.dropna()

0    1.0
1    2.0
2    3.0
4    4.0
5    5.0
dtype: float64

In [29]:
# You can create a new series for storing the modified one
s2 = s.dropna()

In [30]:
s2

0    1.0
1    2.0
2    3.0
4    4.0
5    5.0
dtype: float64

In [31]:
s

0    1.0
1    2.0
2    3.0
3    NaN
4    4.0
5    5.0
dtype: float64

### Dropping null values on DataFrames

In [32]:
df = pd.DataFrame({
    'Column A': [1, np.nan, 30, np.nan],
    'Column B': [2, 8, 31 , np.nan],
    'Column C': [np.nan, 9, 32, 100],
    'Column D': [5, 8, 34, 110]
})

In [33]:
df

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [36]:
df.isnull() # Prints which is True (null) or False (not null)

   Column A  Column B  Column C  Column D
0     False     False      True     False
1      True     False     False     False
2     False     False     False     False
3      True      True     False     False

In [37]:
df.isnull().sum() # Returns num of nulls

Column A    2
Column B    1
Column C    1
Column D    0
dtype: int64

In [38]:
df.shape

(4, 4)

In [42]:
df.dropna() # Drops/deletes any row at least has 1 null value

   Column A  Column B  Column C  Column D
2      30.0      31.0      32.0        34

In [40]:
df

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [43]:
df.dropna(how = 'all') # Drops if all values are Null

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [45]:
df.dropna(how = 'any') # Drops if any value is Null - default behavior

   Column A  Column B  Column C  Column D
2      30.0      31.0      32.0        34

In [46]:
df

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [47]:
df.dropna(thresh = 3) # thresh is the min number of Null values

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34

In [49]:
df

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [48]:
# Operations on columns
df.dropna(thresh = 3, axis = 'columns')

   Column B  Column C  Column D
0       2.0       NaN         5
1       8.0       9.0         8
2      31.0      32.0        34
3       NaN     100.0       110

### Filling null values

* Fills the row that contains null values

    1. You can fill with an arbitrary value 

    2. You can fill with close values to the row

In [50]:
s

0    1.0
1    2.0
2    3.0
3    NaN
4    4.0
5    5.0
dtype: float64

### Filling nulls with an arbitrary value

Any of methods is not modifies the original Series / DataFrames

In [51]:
s.fillna(0) # Fills null with 0

0    1.0
1    2.0
2    3.0
3    0.0
4    4.0
5    5.0
dtype: float64

In [52]:
s.fillna(s.mean()) # Fills null with mean of the column / series

0    1.0
1    2.0
2    3.0
3    3.0
4    4.0
5    5.0
dtype: float64

In [54]:
s # Original Series is not changed!

0    1.0
1    2.0
2    3.0
3    NaN
4    4.0
5    5.0
dtype: float64

### Filling nulls with contiguos (close) values

In [55]:
s

0    1.0
1    2.0
2    3.0
3    NaN
4    4.0
5    5.0
dtype: float64

In [56]:
s.fillna(method = "ffill") #Â front

0    1.0
1    2.0
2    3.0
3    3.0
4    4.0
5    5.0
dtype: float64

In [58]:
s.fillna(method = "bfill") # back

0    1.0
1    2.0
2    3.0
3    4.0
4    4.0
5    5.0
dtype: float64

### Filling null values on DataFrames

In [59]:
df

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [60]:
df.fillna({
    'Column A': 0,
    'Column B': 99,
    'Column C': df['Column C'].mean()
})

   Column A  Column B  Column C  Column D
0       1.0       2.0      47.0         5
1       0.0       8.0       9.0         8
2      30.0      31.0      32.0        34
3       0.0      99.0     100.0       110

In [64]:
df

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [62]:
df.fillna(method='ffill', axis=0) #Â Fills according to the columns

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       1.0       8.0       9.0         8
2      30.0      31.0      32.0        34
3      30.0      31.0     100.0       110

In [65]:
df

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [66]:
df.fillna(method='ffill', axis=1) # Fills according to the row

   Column A  Column B  Column C  Column D
0       1.0       2.0       2.0       5.0
1       NaN       8.0       9.0       8.0
2      30.0      31.0      32.0      34.0
3       NaN       NaN     100.0     110.0

### Checking if there are NAs by length

The question is: Does this Series or DataFrame contains any missing value?

In [67]:
s

0    1.0
1    2.0
2    3.0
3    NaN
4    4.0
5    5.0
dtype: float64

In [68]:
s.dropna().count()

5

In [70]:
len(s) #Â Length of s is greater than count, that means s has missing values

6

In [72]:
s.count() #Â You can use it as well

5

In [75]:
# This is how we check
missing_values = s.count() != len(s) # returns boolean
missing_values

True

### More Pythonic solution: any

In [79]:
pd.Series([True, False, False]).any() #Â Is there any True?

True

In [80]:
pd.Series([True, False, False]).all() # Is all of them are True?

False